app/controllers/posts_controller.rb

UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My edit"], ["description", "My post description"], ["updated_at", "2015-12-31 20:39:10.987245"], ["id", 1]]
---
	def update@post = Post.find(params[:id])
  @post.update(title: params[:title], description: params[:description])